Repository: NikyRosatti/Dungeon-Crawler-AI
Catalog: translations/la/LC_MESSAGES/messages.po
Languages: la

source: User does not exist.
la: Usor non existit.

source: Incorrect credentials.
la: Credentials incorrectae.

source: You must select an avatar
la: Debes seligere avatar

source: Username already exists
la: Usoris nomen iam existit

source: Username must have at least 3 characters
la: Usoris nomen saltem 3 characteres habere debet

source: Username can only contain letters and numbers
la: Usoris nomen solum litteras et numeros continere potest

source: Please enter a valid email address
la: Quaeso, introducere validum inscriptio

source: Password must have at least 8 characters
la: Tessera saltem 8 characteres habere debet

source: Avatar updated successfully!
la: Avatar feliciter renovatum est!

source: Please, select an avatar.
la: Quaeso, selige avatar.

source: Incorrect current password.
la: Tessera currentis incorrecta.

source: New passwords do not match.
la: Novae tesserae non congruunt.

source: Password updated successfully.
la: Tessera feliciter renovata est.

source: Emails do not match.
la: Inscriptiones non congruunt.

source: Email is already in use.
la: Inscriptio iam adhibetur.

source: Email updated successfully.
la: Inscriptio feliciter renovata est.

source: Dashboard
la: Tabula

source: Profile
la: Profilum

source: My Dungeons
la: Meae Dungeons

source: Community Maps
la: Tabulae Communitatis

source: Leaderboard
la: Tabula Dominorum

source: Settings
la: Instauratio

source: Logout
la: Exire

source: All Rights Reserved.
la: Omnia iura reservata.

source: Community Mazes - DC-AI
la: Labyrinthi Communitatis - DC-AI

source: Community Mazes
la: Labyrinthi Communitatis

source: Sort by:
la: Ordina per:

source: Date (Newest to Oldest)
la: Data (Novissimus ad Vetus)

source: Date (Oldest to Newest)
la: Data (Vetus ad Novissimus)

source: Creator Name (A-Z)
la: Nomen Creatoris (A-Z)

source: Creator Name (Z-A)
la: Nomen Creatoris (Z-A)

source: Grid Size (Largest to Smallest)
la: Magnitudo Retis (Maxima ad Minima)

source: Grid Size (Smallest to Largest)
la: Magnitudo Retis (Minima ad Maxima)

source: Apply Filter
la: Applicare Filtrum

source: Previous
la: Praecedens

source: Page
la: Pagina

source: of
la: de

source: Next
la: Sequens

source: Start New Dungeon
la: Incipe Novum Dungeon

source: Choose Dungeon
la: Elige Dungeon

source: Start New Dungeon Sign
la: Incipe Signum Novum Dungeon

source: Embark on a new adventure!
la: Incipe in nova aventura!

source: Choose Dungeon Sign
la: Elige Signum Dungeon

source: Train the AI with your own dungeons
la: Instructio AI cum tuis dungeons

source: Largest Dungeon Completed
la: Maximus Dungeon Perfectus

source: Completed Dungeons
la: Dungeons Perfecti

source: Points
la: Puncta

source: DC-AI, Home
la: DC-AI, Domus

source: Welcome to Dungeons Crawler AI
la: Salve ad Dungeons Crawler AI

source: Your AI-powered adventure begins here
la: Tua aventura potestate AI hic incipit

source: Login
la: Intra

source: Register
la: Constituere

source: Embark on an adventure where artificial intelligence drives the journey. Train, explore, and battle through dungeons!
la: Incipe in aventura ubi intelligentia artificialis iter ducit. Instructio, exploratio, et pugna per dungeons!

source: © 2024 Dungeons Crawler AI. All Rights Reserved.
la: © 2024 Dungeons Crawler AI. Omnia iura reservata.

source: Rank
la: Rang

source: Username
la: Nomen Usoris

source: DC-AI, Login
la: DC-AI, Intra

source: Login into an account
la: Intra in rationem

source: Challenge your mind: log in to explore
la: Provoca mentem tuam: intra ad explorandum

source: Username or Email:
la: Nomen Usoris:

source: Password:
la: Tessera:

source: LOGIN
la: Intra

source: Don't have an account?
la: Non habes rationem?

source: Dynamic Grid
la: Dynamic malesuada euismod

source: Training Progress:
la: Disciplina progressus

source: Train
la: Rang

source: Map Size:
la: Nomen Tabulae:

source: Generate Map
la: Creare Tabulam

source: Export Map
la: Exportare Tabulam

source: Block Type
la: Typus Blocca

source: Floor
la: Tegimen

source: Wall
la: Mur

source: Start
la: Initium

source: End
la: Finis

source: Mine
la: Fossa

source: Avatar of
la: Avatar de

source: Email
la: Inscriptio

source: Joined
la: Coniunctus

source: Change avatar
la: Mutare avatar

source: Save
la: Servare

source: DC-AI, Register
la: DC-AI, Constituere

source: Create Account
la: Creare Rationem

source: Username:
la: Nomen Usoris:

source: Email:
la: Inscriptio:

source: Choose Avatar
la: Elige Avatar

source: Select
la: Elige

source: Please, choose an avatar before registering.
la: Quaeso, elige avatar antequam te constituis.

source: Already have an account?
la: Iam habes rationem?

source: Log in
la: Intra

source: Change Password
la: Mutare Tessera

source: Change Email
la: Mutare Inscriptio

source: Delete Account
la: Delere Rationem

source: Change Language
la: Mutare Linguam

source: Current Password
la: Tessera currentis

source: New Password
la: Nova Tessera

source: Confirm New Password
la: Confirma Novam Tessera

source: Update Password
la: Renovare Tessera

source: New Email
la: Nova Inscriptio

source: Confirm New Email
la: Confirma Novam Inscriptio

source: Update Email
la: Renovare Inscriptio

source: Warning: This action cannot be undone.
la: Monitio: Hoc actio non potest reverti.

source: Are you sure you want to delete your account?
la: Certe vis delere tuam rationem?

source: User Mazes - DC-AI
la: Dungeons Usoris - DC-AI

source: My Created Mazes
la: Meae Dungeons Creatae
