Repository: NikyRosatti/Dungeon-Crawler-AI
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ga

source: User does not exist.
ga: Níl an úsáideoir ann.

source: Incorrect credentials.
ga: Ní réitíonn na creidiúnaithe.

source: You must select an avatar
ga: Caithfidh tú avatar a roghnú

source: Username already exists
ga: Tá an t-ainm úsáideora ann cheana

source: Username must have at least 3 characters
ga: Caithfidh an t-ainm úsáideora a bheith ar a laghad 3 charachtar

source: Username can only contain letters and numbers
ga: Ní féidir le h-ainm úsáideora ach litreacha agus uimhreacha a bheith ann

source: Please enter a valid email address
ga: Le do thoil, cuir isteach seoladh ríomhphoist bailí

source: Password must have at least 8 characters
ga: Caithfidh an pasfhocal a bheith ar a laghad 8 charachtar

source: Avatar updated successfully!
ga: Nuashonraíodh an t-avatar go rathúil!

source: Please, select an avatar.
ga: Le do thoil, roghnaigh avatar.

source: Incorrect current password.
ga: Ní réitíonn an pasfhocal reatha.

source: New passwords do not match.
ga: Ní comhoiriúnach na pasfhocail nua.

source: Password updated successfully.
ga: Nuashonraíodh an pasfhocal go rathúil.

source: Emails do not match.
ga: Ní comhoiriúnach na ríomhphoist.

source: Email is already in use.
ga: Tá an ríomhphost á úsáid cheana.

source: Email updated successfully.
ga: Nuashonraíodh an ríomhphost go rathúil.

source: Dashboard
ga: Painéal

source: Profile
ga: Profail

source: My Dungeons
ga: Mo Dúnóga

source: Community Maps
ga: Mapaí na Comhphobail

source: Leaderboard
ga: Tábla na n-úsáideoirí

source: Settings
ga: Socruithe

source: Logout
ga: Logáil amach

source: All Rights Reserved.
ga: Gach ceart ar cosaint.

source: Community Mazes - DC-AI
ga: Dúnóga na Comhphobail - DC-AI

source: Community Mazes
ga: Dúnóga na Comhphobail

source: Sort by:
ga: Déan socrú de réir:

source: Date (Newest to Oldest)
ga: Dáta (Nua go Seana)

source: Date (Oldest to Newest)
ga: Dáta (Sean go Nua)

source: Creator Name (A-Z)
ga: Ainm an Cruthóra (A-Z)

source: Creator Name (Z-A)
ga: Ainm an Cruthóra (Z-A)

source: Grid Size (Largest to Smallest)
ga: Méid na Grille (Is Mó go Is Lú)

source: Grid Size (Smallest to Largest)
ga: Méid na Grille (Is Lú go Is Mó)

source: Apply Filter
ga: Cuir Filtr i bhfeidhm

source: Previous
ga: Roimhe

source: Page
ga: Leathanach

source: of
ga: de

source: Next
ga: Chun

source: Start New Dungeon
ga: Tosaigh Dún Nua

source: Choose Dungeon
ga: Roghnaigh Dún

source: Start New Dungeon Sign
ga: Tosaigh Comhoiriúnacht Dún Nua

source: Embark on a new adventure!
ga: Tosaigh ar eachtra nua!

source: Choose Dungeon Sign
ga: Roghnaigh Comhoiriúnacht Dún

source: Train the AI with your own dungeons
ga: Déan oiliúnacht ar an AI le do dhúnóga féin

source: Largest Dungeon Completed
ga: Dún is Mó atá Críochnaithe

source: Completed Dungeons
ga: Dúnóga Críochnaithe

source: Points
ga: Pointe

source: DC-AI, Home
ga: DC-AI, Baile

source: Welcome to Dungeons Crawler AI
ga: Fáilte chuig Dúnóga Crawlaithe AI

source: Your AI-powered adventure begins here
ga: Tosaíonn do eachtra a dhéantar le AI anseo

source: Login
ga: Logáil isteach

source: Register
ga: Cláraigh

source: Embark on an adventure where artificial intelligence drives the journey. Train, explore, and battle through dungeons!
ga: Tosaigh ar eachtra ina gcuireann intleacht shaorga tús leis an turas. Oiliún, déan iniúchadh, agus troid trí dhúnóga!

source: © 2024 Dungeons Crawler AI. All Rights Reserved.
ga: © 2024 Dúnóga Crawlaithe AI. Gach ceart ar cosaint.

source: Rank
ga: Rang

source: Username
ga: Ainm Úsáideora

source: DC-AI, Login
ga: DC-AI, Logáil isteach

source: Login into an account
ga: Logáil isteach i gcuntas

source: Challenge your mind: log in to explore
ga: Dúshlán do mheabhair: logáil isteach le haghaidh iniúchadh

source: Password:
ga: Pasfhocal:

source: Don't have an account?
ga: Níl cuntas agat?

source: Export Map
ga: Easpórtáil Léarscáil

source: Block Type
ga: Cineál Bloc

source: Floor
ga: Tír

source: Wall
ga: Balla

source: Start
ga: Tús

source: End
ga: Deireadh

source: Mine
ga: Moinse

source: Avatar of
ga: Avatar de

source: Email
ga: Ríomhphost

source: Joined
ga: Chláraigh

source: Change avatar
ga: Athraigh avatar

source: Save
ga: Sábháil

source: DC-AI, Register
ga: DC-AI, Cláraigh

source: Create Account
ga: Cruthaigh Cuntas

source: Username:
ga: Ainm Úsáideora:

source: Email:
ga: Ríomhphost:

source: Choose Avatar
ga: Roghnaigh Avatar

source: Select
ga: Roghnaigh

source: Please, choose an avatar before registering.
ga: Le do thoil, roghnaigh avatar sula gcláraíonn tú.

source: Already have an account?
ga: An bhfuil cuntas agat cheana?

source: Log in
ga: Logáil isteach

source: Change Password
ga: Athraigh Pasfhocal

source: Change Email
ga: Athraigh Ríomhphost

source: Delete Account
ga: Scrios Cuntas

source: Change Language
ga: Athraigh Teanga

source: Current Password
ga: Pasfhocal reatha

source: New Password
ga: Pasfhocal Nua

source: Confirm New Password
ga: Deimhnigh Pasfhocal Nua

source: Update Password
ga: Nuashonraigh Pasfhocal

source: New Email
ga: Ríomhphost Nua

source: Confirm New Email
ga: Deimhnigh Ríomhphost Nua

source: Update Email
ga: Nuashonraigh Ríomhphost

source: Warning: This action cannot be undone.
ga: Rabhadh: Ní féidir an gníomh seo a chur ar ais.

source: Are you sure you want to delete your account?
ga: An bhfuil tú cinnte go bhfuil tú ag iarraidh do chuntas a scriosadh?

source: User Mazes - DC-AI
ga: Dúnóga Úsáideora - DC-AI

source: My Created Mazes
ga: Mo Dúnóga Cruthaithe
